tutorials/multiform/porousMembrane/0/c.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  inlet
  {
        type            zeroGradient;
    }

    side
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

   top
    {
        type            fixedValue;
        value           uniform 1;
    }

    bottom
    {
        type            noFlux;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
