tutorials/multiform/porousMembrane/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

    (0 0 0)
    (2 0 0)
    (2 1 0)
    (0 1 0)

    (0 0 0.1)
    (2 0 0.1)
    (2 1 0.1)
    (0 1 0.1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (100 200 1)
    simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        neighbourPatch inlet;
        faces
        (
            (1 5 6 2)
        );
    }
   frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (7 6 5 4)
        );
    }
   bottom
   {
       type wall;
//       neighbourPatch top;
       faces
       (
        (0 4 5 1)
       );
   }
   top
   {
       type wall;
       faces
       (
       (3 2 6 7)
       );
    }
);

// ************************************************************************* //
