tutorials/multiform/porousMembrane/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-10;
        relTol          1e-5;
        maxIter         20;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|T|k|epsilon)"
    {
        //type            coupled;
        solver          PBiCGStab;//PBiCCCG;
        preconditioner  DILU;
        smoother        symGaussSeidel;
        tolerance       1e-10;//(1e-10 1e-8 1);
        relTol          1e-5;//(0.01 0.01 1);
    }

    "(U|T|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    c
    {
        solver          GAMG;
        smoother        DILU;
        tolerance       1e-8;
        relTol          1e-4;
    }

    cFinal
    {
        $c;
        relTol          0;
    }

}

PIMPLE
{
    consistent yes;
    momentumPredictor   off;
    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 2;
    pRefCell            0;
    pRefValue           0;
    turbOnFinalIterOnly no;
    residualControl
    {
        ".*"           1e-5;
    }
}

SIMPLE
{
    consistent yes;
    momentumPredictor   off;
    nOuterCorrectors    1;
    nCorrectors         10;
    nNonOrthogonalCorrectors 2;
    pRefCell            0;
    pRefValue           0;
    turbOnFinalIterOnly no;
    residualControl
    {
        ".*"           1e-5;
    }
}

relaxationFactors
{
    equations
    {
        ".*"   0.99;
    }
}


// ************************************************************************* //
